[Killed] BlockStatement
src/basic.js:4:23
 function add (a,b){
     return a+b;
 }
-function subtract(a,b){
-    return a-b;
-}
+function subtract(a,b){}
 function multiply (a,b){
     return a*b;
killedBy: Subtract subtract(5, 3), Expected: 2 returns 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/basic.js:7:24
 function subtract(a,b){
     return a-b;
 }
-function multiply (a,b){
-    return a*b;
-}
+function multiply (a,b){}
 function divide(a,b){
     return a/b;
killedBy: Multiply multiply(3, 5), Expected: 15 returns 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] BlockStatement
src/basic.js:10:21
 function multiply (a,b){
     return a*b;
 }
-function divide(a,b){
-    return a/b;
-}
+function divide(a,b){}
 console.log(add(2,3));
 
killedBy: Divide divide(10, 2), Expected: 5 returns 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined
