[Killed] BlockStatement
src/sorting.js:2:29
 
-function selectionSort(arr) {
-    const len = arr.length;
-    for (let i = 0; i < len - 1; i++) {
-        let minIndex = i;
-        for (let j = i + 1; j < len; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
-        if (minIndex !== i) {
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
-    }
-    return arr;
-}
+function selectionSort(arr) {}
 
 function insertionSort(arr) {
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4, 5, 8]
Received: undefined

[Killed] ConditionalExpression
src/sorting.js:4:21
 
 function selectionSort(arr) {
     const len = arr.length;
-    for (let i = 0; i < len - 1; i++) {
+    for (let i = 0; false; i++) {
         let minIndex = i;
         for (let j = i + 1; j < len; j++) {
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/sorting.js:4:39
 
 function selectionSort(arr) {
     const len = arr.length;
-    for (let i = 0; i < len - 1; i++) {
-        let minIndex = i;
-        for (let j = i + 1; j < len; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
-        if (minIndex !== i) {
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
-    }
+    for (let i = 0; i < len - 1; i++) {}
     return arr;
 }
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
src/sorting.js:6:22
     const len = arr.length;
     for (let i = 0; i < len - 1; i++) {
         let minIndex = i;
-        for (let j = i + 1; j < len; j++) {
+        for (let j = i - 1; j < len; j++) {
             if (arr[j] < arr[minIndex]) {
                 minIndex = j;
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src/sorting.js:6:29
     const len = arr.length;
     for (let i = 0; i < len - 1; i++) {
         let minIndex = i;
-        for (let j = i + 1; j < len; j++) {
+        for (let j = i + 1; j >= len; j++) {
             if (arr[j] < arr[minIndex]) {
                 minIndex = j;
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src/sorting.js:7:17
     for (let i = 0; i < len - 1; i++) {
         let minIndex = i;
         for (let j = i + 1; j < len; j++) {
-            if (arr[j] < arr[minIndex]) {
+            if (arr[j] >= arr[minIndex]) {
                 minIndex = j;
             }
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/sorting.js:7:17
     for (let i = 0; i < len - 1; i++) {
         let minIndex = i;
         for (let j = i + 1; j < len; j++) {
-            if (arr[j] < arr[minIndex]) {
+            if (true) {
                 minIndex = j;
             }
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/sorting.js:11:13
                 minIndex = j;
             }
         }
-        if (minIndex !== i) {
+        if (false) {
             [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
         }
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/sorting.js:11:29
                 minIndex = j;
             }
         }
-        if (minIndex !== i) {
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
+        if (minIndex !== i) {}
     }
     return arr;
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/sorting.js:18:29
     return arr;
 }
 
-function insertionSort(arr) {
-    const len = arr.length;
-    for (let i = 1; i < len; i++) {
-        let current = arr[i];
-        let j = i - 1;
-        while (j >= 0 && arr[j] > current) {
-            arr[j + 1] = arr[j];
-            j--;
-        }
-        arr[j + 1] = current;
-    }
-    return arr;
-}
+function insertionSort(arr) {}
 module.exports = {
     selectionSort,
killedBy: Insertion Sort Insertion Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4, 5, 8]
Received: undefined

[Killed] BlockStatement
src/sorting.js:20:35
 
 function insertionSort(arr) {
     const len = arr.length;
-    for (let i = 1; i < len; i++) {
-        let current = arr[i];
-        let j = i - 1;
-        while (j >= 0 && arr[j] > current) {
-            arr[j + 1] = arr[j];
-            j--;
-        }
-        arr[j + 1] = current;
-    }
+    for (let i = 1; i < len; i++) {}
     return arr;
 }
killedBy: Insertion Sort Insertion Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/sorting.js:20:21
 
 function insertionSort(arr) {
     const len = arr.length;
-    for (let i = 1; i < len; i++) {
+    for (let i = 1; false; i++) {
         let current = arr[i];
         let j = i - 1;
killedBy: Insertion Sort Insertion Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/sorting.js:23:16
     for (let i = 1; i < len; i++) {
         let current = arr[i];
         let j = i - 1;
-        while (j >= 0 && arr[j] > current) {
+        while (false) {
             arr[j + 1] = arr[j];
             j--;
killedBy: Insertion Sort Insertion Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src/sorting.js:23:26
     for (let i = 1; i < len; i++) {
         let current = arr[i];
         let j = i - 1;
-        while (j >= 0 && arr[j] > current) {
+        while (j >= 0 && arr[j] <= current) {
             arr[j + 1] = arr[j];
             j--;
killedBy: Insertion Sort Insertion Sort sorts 5,3,8,2,1,4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   2,

[Killed] ObjectLiteral
src/sorting.js:31:18
     }
     return arr;
 }
-module.exports = {
-    selectionSort,
-    insertionSort
-}
+module.exports = {}
killedBy: Selection Sort Selection Sort sorts 5,3,8,2,1,4
statusReason: TypeError: sorting.selectionSort is not a function
